app/controllers/dispatchers_controller.rb

  def index
    @rides = Ride.all
    @dispatchers = Dispatcher.all
---
SELECT "rides".* FROM "rides"
SELECT "dispatchers".* FROM "dispatchers"

  def create
    @dispatcher = Dispatcher.new(dispatcher_params)

    respond_to do |format|
      if @dispatcher.save
---
INSERT INTO "dispatchers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "mama"], ["created_at", "2015-08-05 22:58:23.944304"], ["updated_at", "2015-08-05 22:58:23.944304"]]

  def destroy
    @dispatcher.destroy
---
DELETE FROM "dispatchers" WHERE "dispatchers"."id" = ?  [["id", 1]]

    def set_dispatcher
      @dispatcher = Dispatcher.find(params[:id])
---
SELECT  "dispatchers".* FROM "dispatchers" WHERE "dispatchers"."id" = ? LIMIT 1  [["id", 2]]