app/controllers/navigators_controller.rb

SELECT "rides".* FROM "rides"
SELECT "navigators".* FROM "navigators"
---
  def index
    @rides = Ride.all
    @navigators = Navigator.all

SELECT  "navigators".* FROM "navigators" WHERE "navigators"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_navigator
      @navigator = Navigator.find(params[:id])