app/controllers/rides_controller.rb

  def index
    @rides=Ride.all
---
SELECT "rides".* FROM "rides"

  def create
    @ride=Ride.new
    @ride.update(ride_params)
    @ride.save
---
INSERT INTO "rides" ("name", "sid", "phone", "passengers", "origin", "destination") VALUES (?, ?, ?, ?, ?, ?)  [["name", "mang"], ["sid", "gucchi"], ["phone", "666"], ["passengers", 6.0], ["origin", "no"], ["destination", "10"]]

  def edit
    @ride=Ride.find(params[:id])
---
SELECT  "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", 1]]

  def show
    @ride=Ride.find(params[:id])
---
SELECT  "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @ride=Ride.find(params[:id])
    @ride.update(ride_params)
---
SELECT  "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "rides" SET "name" = ?, "sid" = ? WHERE "rides"."id" = ?  [["name", "Banana"], ["sid", "951222222"], ["id", 1]]

  def destroy
    @ride=Ride.find(params[:id])
    @ride.delete
---
SELECT  "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "rides" WHERE "rides"."id" = ?  [["id", 1]]